#1. List (სიები)
#List არის შეკრებილი ელემენტების თანმიმდევრობა, რომელიც შესაძლოა შეიცავდეს სხვადასხვა ტიპის მონაცემებს, როგორიცაა რიცხვები, სტრიქონები, ბუშტები და ა.შ. ლისტში ელემენტებს სხვადასხვა ტიპის მონაცემები შეუძლიათ.



my_list = [1, "apple", 3.14, True]


my_list[1] = "banana" 


my_list.append("orange")

print(my_list)  



#2. String (სტრიქონები)
#String (სტრიქონი) არის სიმბოლოების სერია, რომელიც ქმნის ტექსტს. სტრიქონი ყოველთვის ხორციელდება ტექსტის სახით, ანუ მისი ელემენტები მხოლოდ სიმბოლოებია.




my_string = "hello"

new_string = my_string.replace("e", "a")

print(new_string) 
