
fruit = ["ვაშლი", "ფორთოხალი", "ბანანი", "მანგო", "ატამი", "კივი", "ანანასი", "მსხალი", "გრეიფრუტი", "ალუბალი"]


print("მესამე ელემენტი:", fruit[2])

fruit[0] = "მსხალი"
print("განახლებული სია:", fruit)

print("2-დან 5-მდე ელემენტები:", fruit[1:5])

print("მეორე ელემენტიდან ყველა:", fruit[1:])

print("მეხუთე ელემენტამდე:", fruit[:5])

print("შებრუნებული სია:", fruit[::-1])




"""```1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველი ელემენტები, მინიმუმ 10```
**indexing**
- გამოიტანეთ სიაში არსებული მესამე ელემენტი
- ჩაანაცვლეთ სიაში არსებული პირველი ელემენტი
**slicing**
- დაბეჭდეთ 2-დან მე-5 ელემენტამდე 
- დაბეჭდეთ მეორე ელემენტიდან ყველა ელემენტი
- დაბეჭდეთ მეხუთე ელემენტამდე ყვეალფერი
- დაბეჭდეთ სია შემობრუნებულად"""