"""2) შექმენით სია რომელშიც ჩამოწერთ ისტორული ეპოქები, უნდა გქონდეთ მინიმუმ 5 ეპოქა. უარყოფითი ინდექსების საშვალებით გამოიტანეთ indexing და slicing მეთოდის საშვალებით ელემენტები

ბოლო სამი ელემენტი
ბოლო ელემენტი
მეორე ელემენტიდან ყველაფერი
მესამე ელემენტამდე ყველაა ეპოქა"""



epochs = ["ქვის ხანა", "ბრინჯაოს ხანა", "რკინის ხანა", "ანტიკური ხანა", "საშუალო საუკუნეები"]

print("ბოლო სამი ეპოქა:", epochs[-3:])

print("ბოლო ეპოქა:", epochs[-1])

print("მეორე ეპოქიდან ყველაფერი:", epochs[-4:])

print("მესამე ეპოქამდე ყველაფერი:", epochs[:-2])
