""""2) გააკეთეთ პროგრამა რომელშიც გექნებათ ცვლდი სადაც შეინახავთ თქვენს hobby-ის, ასევე შექმენით string ტიპის ცვლადი რომელშიც შეინახვათ თქვენთვის სასურველ მესიჯს, შემდეგ ეს ორი ტექსტი დაბეჭდეთ ერთად, ასევე აიღეთ 2 integer ტიპის ცვლადი და დაბეჭდეთ მათი შეკრებაც, თქვენი სიტყვებით ახსენით რა განსხვავებაა ამ ორი სხვადასხვა ტიპის ცვლადების დამატების ოპერაციებს შორის, რა ეწოდება თითოეულ მოვლენას
"""
#ცვლადი ჰობი
hobby = "Studyng"
#ცვლადი ჩემი მესიჯი
message = "I love Goal Oriented Academy"
print(message, hobby)

#int 1
int = 2
#int 2
int2 = 4
#print int1 and int2
print(int, int2)
print(int + int2)
#როდესაც პრინტ ბრძანებით ჩავწერთ ინტეჯერს დამატების ან რაიმე სხვა მოქმედების გარეშე ის გამოიტანს იმ რიცხვებს რომლებიც ჩვენ ჩავწერეთ მაგ: print(int + int2) ამ კოდის დაწერის და გაშვების შედეგად მივიღებთ 24
#როდესაც პრინტ ბრძანებით დავწერთ ინტეჯერს დამატებით ან სხვა მოქმედებით მაშინ ჩვენ მივიღებთ ამ რიცხვების ჯამს მაგ: print(int + int2) ამ კოდის დაწერის და გაშვების შედეგად მივიღებთ 6




