"""1) შექმენით mybalance-ის ცვლადი, შემდეგ გაზარდეთ ამ ცვლადის მნიშვნელობა 2-თ უბრალო ფორმით, შემდეგ ისევ გაზარდეთ მნიშვნელობა 3-ით ოღონდ გამოიყენეთ assignment operator, ამის შემდეგ თქვენი სურვილისამებრ შეცვალეთ ცვლადის მნიშვნელობა იგივე assignment operator-ის საშვალებით, საბოლოოდ დაბეჭდეთ balance. კოდი ახსენით კომენატრებით, ჩამოწერეთ ყველა საუკეტესო პრაქტიკა და მიუწერეთ განმარტებები"""
# mtbalance ცვლადი რომელიც უდრის 10
my_balance = 10
#გაიზარდა 2 ით
my_balance = my_balance + 2
#გაიზარდა 3 ით
my_balance +=3
print(my_balance)
