"""2) მომხმარებელს შემოატანინეთ თავისი სიმაღლე, შემდეგ შემოატანინეთ წლების რაოდენობა, მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოუთვალეთ მომხმარებელს სავაურდო სიმაღლე EH (Estimated Height) როდესაც გავა y წელი (რაც მომხმარებლმა შემოიტანა) თუ დაუშვათ ყოველ წელს სიმაღლე იზრდება 0.5-ით. საბოლოოდ გამოუტანეთ EH"""


height = input("what is your height: ")
#გადაყვანა სტრინგიდან ფლოატზე
height = float(height)
#შემოვიტანეთ მომხმარებლის ასაკი
age = int(input("what is your age: "))
height = height + (age + 0.5)
print(height)





