
ვეფხის_ტყაოსანი=("65 lari")
ტომსოიერის_თავგადასავალი=("35 lari")
ბიძიათომას_ქოხი=("38 lari")
წიგნის_ქურდი=("42 lari")


ფასდაკლება_ჰარი_პოტერზე=("25 lari")
ფასდაკლება_ვეფხის_ტყაოსანზე=("30 lari")
ფასდაკლება_ტომსოიერის_თავგადასავალზე=("15 lari")
ფასდაკლება_ბიძიათომას_ქოხი=("15 lari")
ფასდაკლება_წიგნის_ქურდზე=("21 lari")


ჰარი_პოტერი=(45-25 )
ვეფხის_ტყაოსანი=(65-30 )
ტომსოიერის_თავგადასავალი=(35-15 )
ბიძიათომას_ქოხი=(38-15)
წიგნის_ქურდი=(42-21 )



print(ჰარი_პოტერი)
print(ვეფხის_ტყაოსანი)
print(ტომსოიერის_თავგადასავალი)
print(ბიძიათომას_ქოხი)
print(წიგნის_ქურდი)
